tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "fsouza/prettierd"
cask_args appdir: "/Applications"

brew "arp-scan"
brew "asdf"
brew "bat"
brew "exa"
brew "gawk"
brew "git"
brew "gnupg"
brew "jq"
brew "mas"
brew "neovim"
brew "sqlite"
brew "xz"
brew "tcl-tk"
brew "python-tk@3.9"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "zsh"
brew "fsouza/prettierd/prettierd"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "alacritty"
cask "appcleaner"
cask "binance"
cask "brave-browser"
cask "deepl"
cask "docker"
cask "dropbox"
cask "figma"
cask "font-hack-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "insomnia"
cask "karabiner-elements"
cask "ledger-live"
cask "miro"
cask "notion"
cask "obsidian"
cask "sourcetree"
cask "spotify"
cask "tableplus"
cask "telegram"
cask "visual-studio-code"
cask "whalebird"

mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Autodesk Pixlr", id: 880663569
mas "CalcMadeEasy", id: 417404127
mas "Color Picker", id: 641027709
mas "ColorSnapper", id: 418176775
mas "Composure", id: 656377653
mas "Craft", id: 1487937127
mas "exifpurge", id: 784466108
mas "feedly", id: 865500966
mas "Fotor Photo Editor", id: 503039729
mas "iMage Tools", id: 493949693
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "MARKETSPEED", id: 946680495
mas "Memory Clean", id: 451444120
mas "NFT Creator", id: 1602374609
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "PopClip", id: 445189367
mas "QaLL", id: 480452005
mas "QREncoder", id: 452695239
mas "StuffIt Expander", id: 405580712
mas "The Unarchiver", id: 425424353
mas "ToyViewer", id: 414298354
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
mas "XnSketch", id: 567379804
mas "フリーフォント（商用オープンタイプフォント550種", id: 647697434
mas "宛名職人V24M", id: 1225545286
