tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
cask_args appdir: "/Applications"

brew "arp-scan"
# brew "asdf"
brew "bat"
brew "gawk"
brew "git"
brew "gnupg"
brew "mas"
brew "neovim"
# brew "sqlite"
brew "xz"
brew "starship"
# brew "stow"
brew "tmux"
brew "tree"
brew "zsh"
brew "fsouza/prettierd/prettierd"

cask "alacritty", args: { appdir: "/Applications" }
cask "appcleaner", args: { appdir: "/Applications" }
cask "binance", args: { appdir: "/Applications" }
cask "brave-browser", args: { appdir: "/Applications" }
cask "bruno"
cask "deepl", args: { appdir: "/Applications" }
cask "dropbox", args: { appdir: "/Applications" }
cask "figma", args: { appdir: "/Applications" }
cask "font-code-new-roman-nerd-font", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "insomnia", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "ledger-live", args: { appdir: "/Applications" }
cask "miro", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "obsidian", args: { appdir: "/Applications" }
cask "podman-desktop"
cask "popclip"
cask "sourcetree", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "tableplus", args: { appdir: "/Applications" }
cask "telegram", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "whalebird", args: { appdir: "/Applications" }

mas "1Password for Safari", id: 1569813296
mas "CalcMadeEasy", id: 417404127
mas "Color Picker", id: 641027709
mas "Craft", id: 1487937127
mas "Fotor Photo Editor", id: 503039729
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MARKETSPEED", id: 946680495
mas "NFT Creator", id: 1602374609
mas "OneDrive", id: 823766827
mas "QaLL", id: 480452005
mas "QREncoder", id: 452695239
mas "The Unarchiver", id: 425424353
mas "ToyViewer", id: 414298354
mas "Xcode", id: 497799835
mas "XnSketch", id: 567379804
mas "フリーフォント（商用オープンタイプフォント550種", id: 647697434
